## Enable MP-BGP

Multiprotocol Extensions for BGP (MP-BGP) is an extension of BGP that allows different types of addresses to be distributed in parallel.
Here, we use MP-BGP in the context of BGP-MPLS VPNs : MP-BGP is used to distribute the VPN routing information between the relevant PEs.

To configure MP-BGP in the case of a VPN for a business, we need to create an iBGP session between the PEs connected to the CEs of that business.
Configure an iBGP session between PEs like you would normally, and add the settings for the Address Family to carry VPN-IPv4 address information.

Here, we add this setting between the `NEWY` router of AS 8 which is connected to one site of company Y, and the `STLO` router (8.157.0.1) which is connected to the other site.

```
router# conf t
router(config)# router bgp 8
NEWY_router(config-router)# address-family ipv4 vpn
NEWY_router(config-router-af)# neighbor 8.157.0.1 activate
NEWY_router(config-router-af)# exit-address-family
```

To check your configuration, you can display the BGP summary.
The IPv4 VPN Summary should be included in the output of the command.

```
NEWY_router# sh ip bgp summary
IPv4 Unicast Summary:
BGP router identifier 8.152.0.1, local AS number 8 vrf-id 0
BGP table version 35
RIB entries 39, using 7488 bytes of memory
Peers 12, using 256 KiB of memory

Neighbor        V         AS   MsgRcvd   MsgSent   TblVer  InQ OutQ  Up/Down State/PfxRcd   PfxSnt
8.151.0.1       4          8      8549      8540        0    0    0 5d22h15m           10        1
8.153.0.1       4          8      8541      8540        0    0    0 5d22h15m            2        1
8.154.0.1       4          8      8540      8540        0    0    0 5d22h15m            1        1
8.155.0.1       4          8      8565      8540        0    0    0 5d22h15m            7        1
8.156.0.1       4          8      8577      8545        0    0    0 5d04h35m            6        1
8.157.0.1       4          8      8572      8581        0    0    0 00:00:13            2        1
8.158.0.1       4          8      8541      8540        0    0    0 5d22h15m            2        1
8.159.0.1       4          8      8540      8540        0    0    0 5d22h15m            1        1
8.160.0.1       4          8      8540      8540        0    0    0 5d22h15m            1        1
8.161.0.1       4          8      8540      8540        0    0    0 5d22h15m            1        1
8.162.0.1       4          8      8540      8540        0    0    0 5d22h15m            1        1
8.163.0.1       4          8      8540      8540        0    0    0 5d22h15m            1        1

Total number of neighbors 12

IPv4 VPN Summary:
BGP router identifier 8.152.0.1, local AS number 8 vrf-id 0
BGP table version 0
RIB entries 0, using 0 bytes of memory
Peers 1, using 21 KiB of memory

Neighbor        V         AS   MsgRcvd   MsgSent   TblVer  InQ OutQ  Up/Down State/PfxRcd   PfxSnt
8.157.0.1       4          8      8572      8581        0    0    0 00:00:13            0        0

Total number of neighbors 1
```

You can also look at the BGP table for VPNs. At this stage, no prefixes should be displayed since no routes have been learned.

```
NEWY_router# sh bgp ipv4 vpn
No BGP prefixes displayed, 0 exist
```

## Create VRFs

Since nodes in different VPNs cannot talk to each other, the routing information of different VPNs must be stored in different structures. This is possible thanks to VRF (Virtual Routing and Forwarding), which allows us to store routing information in different tables (one per VPN).

In order to use VRF, the router interfaces (in your AS) connected to a customer edge need to be assigned to a particular VRF. FRRouting builds on Linux VRF, and the VRF interfaces need to be created in Linux before we can configure them in FRRouting.

To create them, we will go on the container of the routers and use the `ip` command.
Note that you can use the `ip link` command to display your VRF settings.
Once in the container, we create the VRF table, set it 'up' and bind the VRF to the interface.

```
root@g8-proxy:~# ./goto.sh NEWY container
root@NEWY_router:~# ip link add VRF_Y type vrf table 10
root@NEWY_router:~# ip link set VRF_Y up
root@NEWY_router:~# ip link set port_YNEWY master VRF_Y
```

Use `ip link` to verify your configuration.
You can also verify your configuration on the router by making sure the interface shows up with `show interface brief`.

```
NEWY_router# sh int brief
Interface       Status  VRF             Addresses
---------       ------  ---             ---------
VRF_Y        up      VRF_Y
port_YNEWY      up      VRF_Y       8.0.16.2/24

Interface       Status  VRF             Addresses
---------       ------  ---             ---------
VRF_X        down    VRF_X

Interface       Status  VRF             Addresses
---------       ------  ---             ---------
host            up      default         8.102.0.2/24
lo              up      default         8.152.0.1/32
port_BROO       up      default         8.0.1.2/24
port_CHAR       up      default         8.0.4.1/24
port_PITT       up      default         8.0.3.1/24
port_XNEWY      up      default         8.0.13.2/24
ssh             up      default         158.8.11.1/16
```

You can see a list of the interfaces in the default VRF with the command `show interface brief`. To show interfaces in other VRFs, you need to use the command `show interface vrf VRF_NAME brief`. You can either enter a specific VRF, or use `all`.


## Configure VPNs

### Static routes
#### Routing


For the CE, every non-local destination is located behind its PE. Thus, you should add a default route on the CE directed towards its PE.



For example, on the CE of company Y, on YNEWY:
```
YNEWY_router# conf t
YNEWY_router(config)# ip route 0.0.0.0/0 200.0.2.2
```

The PE, on the other hand, only requires a static route in order to join its side of the VPN. 


For example, on NEWY for the VPN Y:

```
NEWY(config)# ip route 192.168.2.0/24 200.0.2.1 vrf VRF_Y
```

The above configuration is the only static route required by the PE. Each PE then shares this knowledge to the other PEs of the VPN. For example, for the VPN Y, NEWY knows how to reach 192.168.0.0/24 through its static route. This knowledge is shared (through MP-BGP) to the other PE, i.e., STLO. Upon receiving the MP-BGP message, STLO knows that NEWY knows how to reach 192.168.0.0/24.

To display routes for this VRF, use `show ip route vrf VRF_Y`.


#### MP-BGP (with static routes)

MP-BGP is used to carry VPN-related information (i.e., the route towards the CE) among the relevant PE.  While the MP-BGP sessions should already be established through the commands above, you now have to explicitly state which routes to distribute to the other PEs. This can be done as shown below.

```
NEWY_router# conf t
NEWY_router(config)# router bgp 8 vrf VRF_Y
NEWY_router(config-router)# address-family ipv4
NEWY_router(config-router-af)# redistribute static
NEWY_router(config-router-af)# label vpn export auto
NEWY_router(config-router-af)# rd vpn export 1:100
NEWY_router(config-router-af)# rt vpn both 10:100
NEWY_router(config-router-af)# export vpn
NEWY_router(config-router-af)# import vpn
```

Here, we redistribute the information learned through a static route into MP-BGP. Thus, other PE know about our (static) routing knowledge regarding VRF_Y. 

The `label vpn export auto` command  allows us to add the MPLS label to the route automatically when it is exported to the global routing table.

 The `rt` command defines the rule of import/export of the VPN routing information. It allows you to export VPN routes with a certain tag, and to only import routes with a certain tag. In particular, `rt` is useful to perform more intricate routing between the various sites of a company (e.g., if two sites should not know about each other).

The `rd` command is a simple identifier for the VPN from which a route originates.

`export | import vpn` allows the import/export of routes between VRF and global routing table.

To verify your configurations, you can consult the BGP table.

```
NEWY# show ip bgp ipv4 vpn
BGP table version is 8, local router ID is 8.152.0.1, vrf id 0
Default local pref 100, local AS 8
Status codes:  s suppressed, d damped, h history, * valid, > best, = multipath,
               i internal, r RIB-failure, S Stale, R Removed
Nexthop codes: @NNN nexthop's vrf id, < announce-nh-self
Origin codes:  i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
Route Distinguisher: 1:100
*>i192.168.1.0/24   8.157.0.1                0    100      0 ?
    UN=8.157.0.1 EC{10:100} label=144 type=bgp, subtype=0
*> 192.168.2.0/24   200.0.0.1@2<             0         32768 ?
    UN=200.0.0.1 EC{10:100} label=144 type=bgp, subtype=5

Displayed  2 routes and 2 total paths
```

You can also look at the BGP table for a specific VRF.

```
NEWY# show ip bgp vrf VRF_Y
BGP table version is 4, local router ID is 200.0.0.2, vrf id 2
Default local pref 100, local AS 8
Status codes:  s suppressed, d damped, h history, * valid, > best, = multipath,
               i internal, r RIB-failure, S Stale, R Removed
Nexthop codes: @NNN nexthop's vrf id, < announce-nh-self
Origin codes:  i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 192.168.1.0/24   8.157.0.1@0<             0    100      0 ?
*> 192.168.2.0/24   200.0.0.1                0         32768 ?

Displayed  2 routes and 2 total paths
```

Finally, you can verify the route table for each VRF.

```
NEWY# show ip route vrf VRF_Y
Codes: K - kernel route, C - connected, S - static, R - RIP,
       O - OSPF, I - IS-IS, B - BGP, E - EIGRP, N - NHRP,
       T - Table, v - VNC, V - VNC-Direct, A - Babel, D - SHARP,
       F - PBR, f - OpenFabric,
       > - selected route, * - FIB route, q - queued, r - rejected, b - backup

VRF VRF_Y:
B>  192.168.1.0/24 [200/0] via 8.157.0.1 (vrf default) (recursive), label 144, weight 1, 15:53:39
  *                          via 8.0.3.2, port_PITT (vrf default), label 53/144, weight 1, 15:53:39
S>* 192.168.2.0/24 [1/0] via 200.0.0.1, port_YNEWY, weight 1, 14:24:12
C>* 200.0.0.0/24 is directly connected, port_YNEWY, 16:22:29
```


### OSPF

#### Routing

When sites should be connected through OSPF, the goal of the PE routers if fairly simple. 
First, the latter should learn the routes of the sites its connected to. This is done by putting adding the PE within the OSPF of the VPN (i.e., the PE and its CE share an OSPF adjacency and exchange route through OSPF). Note that, for the PE, this OSPF is a different process than the OSPF used within its own AS.

Thus, to enable OSPF between the PE and the CE, we need to create another OSPF process on the PE, so as to not share your entire AS to the CE. This new OSPF process will run in a distinct VRF.

On the PE, the new OSPF process will advertise the link between the PE and the CE.
Similarly, the OSPF process on the CE (which does not run on a VRF, as all the VRF setup is transparent for the clients), will also advertise the link between the PE and the CE: this creates a shared OSPF adjacency between the CE and the PE through which they can exchange routes.

```
NEWY_router# conf t
NEWY_router(config)# router ospf vrf VRF_X
NEWY_router(config-router)# network 200.0.4.0/24 area 0
```
```
XNEWY_router# conf t
XNEWY_router(config)# router ospf
XNEWY_router(config-router)# network 200.0.4.0/24 area 0
```

Within OSPF, XNEWY should advertise its loopback and its host network, so that the other site may (ultimately) communicate with it. The CE needs no knowledge of VRF. Therefore, we can create the OSPF configuration as usual. 

```
XNEWY_router# conf t
XNEWY_router(config)# router ospf
XNEWY_router(config-router)# network 192.168.4.0/24 area 0
XNEWY_router(config-router)# network 192.168.4.151/32 area 0
```

#### MP-BGP

When the PE learns about these routes, it has to relay them to the other distant site of the company. This is performed once again through MP-BGP. More precisely, the routes learned through OSPF are redistributed within MP-BGP to the other PEs.

```
NEWY_router# conf t
NEWY_router(config)# router bgp 8 vrf VRF_X
NEWY_router(config-router)# address-family ipv4
NEWY_router(config-router-af)# redistribute ospf
NEWY_router(config-router-af)# label vpn export auto
NEWY_router(config-router-af)# rd vpn export 2:100
NEWY_router(config-router-af)# rt vpn both 20:100
NEWY_router(config-router-af)# export vpn
NEWY_router(config-router-af)# import vpn
```

Thus, when a PE receives routes for its site through MP-BGP, it should re-advertise them within the OPSF of its client (so that distant client sites can then talk to one another).

We thus also need to redistribute BGP into this OSPF process, in order for the CE to learn the routes to the other CEs.

```
NEWY_router# conf t
NEWY_router(config)# router ospf vrf VRF_X
NEWY_router(config-router)# network 200.0.4.0/24 area 0
NEWY_router(config-router)# redistribute bgp
```
